In [8]:
library(tidyverse)
library(repurrrsive)


# unnest_longer and unnest_wider

`clans` is a list, contains 2 lists (`VNC` and `Daemones`)  
    Each list (`VNC` and `Daemones`) contains several named list (each named list is the information about a member of that clan)

In [27]:
VNC <- list(
    list(name = 'VN Pikachu', level = 31, sex = 'Male'),
    list(name = 'Morino Nanako', level = 34, sex = 'Female'),
    list(name = 'Gravita', level = 33, sex = 'Male')
)

Daemones <- list(
    list(name = 'KING COBRA', level = 33, sex = 'Male'),
    list(name = 'Monkey', level = 34, sex = 'Female')
)

clans <- list(VNC, Daemones)

`TF` is a tibble. Each row is a list of named list

In [28]:
TF <- tibble(clan = clans)

TF

  clan
1 VN Pikachu   , 31           , Male         , Morino Nanako, 34           , Female       , Gravita      , 33           , Male
2 KING COBRA, 33        , Male      , Monkey    , 34        , Female

In [22]:
print(TF)

# A tibble: 2 x 1
  clan
  <list>
1 <list [3]>
2 <list [2]>

Turn **1** row of **multiple** named list to **multiple** rows of ONLY **1** named list

In [31]:
#Now each row is a named list
TF_longer <- TF %>% unnest_longer(clan)

TF_longer

  clan
1 VN Pikachu, 31        , Male
2 Morino Nanako, 34           , Female
3 Gravita, 33     , Male
4 KING COBRA, 33        , Male
5 Monkey, 34    , Female

Each row `TF_longer` is a named list. turn 1 column of a named list to multiple columns of just 1 value

In [32]:
TF_longer %>% unnest_wider(clan)

  name          level sex
1 VN Pikachu    31    Male
2 Morino Nanako 34    Female
3 Gravita       33    Male
4 KING COBRA    33    Male
5 Monkey        34    Female